
{
    "csse": [
        {
            "time": "1:00 PM - 1:15 PM",
            "projectId": "csse-3-100",
            "title": "MASS CUDA: GPU Simulation Benchmark Applications",
            "studentName": "Omar Ahmed",
            "studentMajor": "CSSE",
            "projectType": "Faculty Research",
            "facultyAdvisor": "Dr. Munehiro Fukuda ",
            "posterLink": "./posters/csse/ahmedomar_4022376_113475603_Poster-Final.png",
            "abstract": "For my CSSE Capstone project, I joined Dr. Fukuda’s Distributed Systems Laboratory as an Undergraduate Research Assistant working as an application developer on The MASS CUDA Library Project. The MASS (Multi-Agent Spatial Simulation) Library is an implementation of MASS specifically using the Nvidia CUDA framework for GPU Acceleration.\n\nMy work involved researching and implementing three of seven MASS CUDA benchmark applications. These applications are Conway’s Game of Life, Social Network, and Tuberculosis GPGPU simulation applications.\n\nThe motivation behind developing these applications is to measure the performance and  efficiency of the MASS CUDA Library, showcase a set of standard applications implemented using the library, expose bugs and programmability errors, and provide publishable metrics for MASS CUDA. \n\nMy development aims to provide a usable and bug-free library for application developers, serve as a proof of concept for the GPU-parallel implementation of the original MASS Library, and extend existing MASS benchmark application specifications in Nvidia CUDA.\n\nRegarding the process of implementing the three applications above, as all three application specifications are different so was each of their implementation processes. The MASS CUDA agent-based model has two abstractions: Places (a matrix of elements allocated on GPU CUDA memory blocks) and Agents (a set of stateful execution instances that can reside in a Place). Conway’s Game of Life Application is a simulation that determines the end state of the grid given an initial state based on the rules of Conway’s Game of Life Mathematical game. The Social Network application is a simulation that calculates the xth-degree list of friends of n users in the network, where each user has k friends. Finally, the Tuberculosis benchmark application is a simulation of a grid of tuberculosis-infected human lung tissue, and it determines the end state of the grid after x iterations.\n\nMy work resulted in the complete development, benchmarking, visualization, and production of publishable data for Conway’s Game of Life and Social Network applications, while the Tuberculosis application was still under development. In comparison to its FLAME GPU implementation, the Game of Life MASS CUDA benchmarks 85% better programmability while being 200x slower in parallel performance. In comparison to its MASS C++ implementation, the Social Network MASS CUDA benchmarks almost 30% better programmability while providing parallel performance 300x better."
        },
        {
            "time": "1:15 PM - 1:30 PM",
            "projectId": "csse-3-115",
            "title": "Embedded Software Development on Aerial Lifts",
            "studentName": "Daniel Kurt",
            "studentMajor": "CSSE",
            "projectType": "Sponsored Internship or job opportunity ",
            "facultyAdvisor": "Dr. Munehiro Fukuda ",
            "posterLink": "./posters/csse/kurtdanielbodie_LATE_3944033_113491008_Daniel Kurt - Capstone.pdf.png",
            "abstract": ""
        },
        {
            "time": "1:30 PM - 1:45 PM",
            "projectId": "csse-3-130",
            "title": "Check-In-Application for Renewal Food Bank",
            "studentName": "Long Pham",
            "studentMajor": "CSSE",
            "projectType": "Sponsored Internship or job opportunity ",
            "facultyAdvisor": "Dr. Munehiro Fukuda ",
            "posterLink": "./posters/csse/phamlongphi_4180248_113477507_LongPham_Poster.jpg",
            "abstract": " The Capstone project involved my internship at Renewal Food Bank, a non-profit organization based in Bellevue, WA, that serves a large number of low-income individuals across Washington. With a growing demand for their services, the organization aimed to expand its reach and improve data accuracy for informed decision-making. During my internship, I joined a software team already working on the project and familiarized myself with the working environment and tools. My responsibilities encompassed both front-end and back-end development, involving JavaScript, nodeJS, mySQL, JSX, graphQL, and ReactJS.\n\n One of the primary challenges was data quality. Many customers provided addresses were inaccurate, leading to storage inefficiencies and data inconsistencies. To address this, we added a latitude/longitude (lat/lng) column to the household data structure, populating it with accurate data from the Google Maps API. This allowed us to remove invalid addresses, a crucial step before generating a heatmap.\n\n Once the heatmap was successfully deployed, our focus shifted to enhancing its functionality. We developed features to filter data by different time frames, display the number of people from each city, and adjust marker radius, aiding in data analysis. Concurrently, we tackled website performance optimization, albeit with a temporary solution, and began designing a self-check-in and address validation system.\n\n Throughout the internship, I gained valuable insights into the software engineering industry, expanding my skills in web design, prototyping, communication, database management, and more. Despite not achieving our ultimate goal, we reached significant milestones, and I remain optimistic about the team's ability to complete the project in the near future. This experience has been instrumental in my professional growth, and I look forward to further exploration and improvement in the field. "
        },
        {
            "time": "1:45 PM - 2:00 PM",
            "projectId": "csse-3-145",
            "title": "Mechapunk Fury",
            "studentName": "Abdul Naveed",
            "studentMajor": "CSSE",
            "projectType": "Group Project",
            "facultyAdvisor": "Dr. Kelvin Sung",
            "posterLink": "./posters/csse/naveedabdul_4103212_113296493_CapstonePoster.png",
            "abstract": "For my capstone project, I worked in a team of four over the summer to create a 2-D isometric “beat-em-up” style videogame called MechaPunk Fury that has unique enemies, a complex combat system, and puzzles that get increasingly challenging as the player progresses through the four levels. We developed it using the Unity game engine, coded in C#, and used external tools such as Trello to help us achieve an agile development style.\n\n I specifically wanted to learn and practice how to successfully develop a video game using an agile SDLC approach, whilst utilizing object-oriented programming (OOP) skills and a polymorphic design and do effective playtests that would improve the gaming experience. However, we ran into a few problems whilst in development. One of those issues were merge conflicts with the source control we were using called GitHub. Another issue we encountered happened early on where the team did not meet as frequently as we should have. To solve these issues, we slightly changed our workflow to instead do frequent merges to the main branch itself as opposed to merging with the team member’s personal branches. We also utilized Trello and Discord more to help mitigate that lack of communication early on and to make sure we successfully got our work done in time.\n\n At the end of the project, we created a rich and intricate state machine system for both the enemies and players that allowed for fun combat, puzzles, interactions, and levels that were extremely entertaining which made the whole video game feel like a real cohesive game. I had achieved what I set out to learn as well.\n\n We created a successful videogame using a Kanban SDLC style, using multiple OOP principles with polymorphism, and had extremely successful playtesting sessions that exponentially helped with developing a great game. Using the Trello and the Kanban style of development was extremely helpful for organizing workflow and quick iterative development. Using OOP principles was also extremely helpful, and it was a powerful tool that allowed us to meet our development goals. Being prepared before a playtest with proper survey questions and taking notes while observing play testers worked exceptionally well. However, what is most important in any group project is successful collaboration and communication within all team members. "
        },
        {
            "time": "2:00 PM - 2:15 PM",
            "projectId": "csse-3-200",
            "title": "Aeyesafe Software engineer intern",
            "studentName": "Chloe Ngo",
            "studentMajor": "CSSE",
            "projectType": "Sponsored Internship or job opportunity ",
            "facultyAdvisor": "Dr.  Kelvin Sung",
            "posterLink": "./posters/csse/ngochloe_4053198_113415590_Chloe Ngo Poster-1.pdf.png",
            "abstract": "During my internship at Aeyesafe, a startup specializing in AI sensor technology for senior care, I had the privilege of contributing to the development of their alert system. Aeyesafe's mission revolves around enhancing the safety and well-being of seniors through non-intrusive monitoring, aiming to strike a harmonious balance between ensuring their independence and providing caregivers with peace of mind. The company's innovative approach centers on AI-driven sensors, including thermal, Radar/LiDar, and sleep sensors, which monitor seniors' daily activities and health status with unmatched accuracy and seamlessness.\n\n My primary role at Aeyesafe involved developing and integrating a sophisticated alert system tailored to monitor seniors' health and daily activities. This role encompassed every aspect of system development, from the initial concept to the final deployment, focusing on delivering an efficient and effective solution.\n\n Crucial to the success of this task was the accurate processing of real-time data, which entailed managing input streams from various advanced sensors. My responsibilities included devising intricate yet responsive algorithms capable of swiftly identifying potential health risks and behavioral anomalies. This aspect of the project was particularly challenging, demanding a deep understanding of the technical and practical aspects of real-time data processing. The culmination of my efforts resulted in an alert system that significantly enhanced the capacity to provide timely updates to caregivers, marking a significant advancement in responding to potential emergencies in senior care. While the system effectively ensures the safety of seniors, it also brought to light the inherent challenges in achieving instant responsiveness, chiefly due to slight delays in signal detection from the devices. This aspect underscored the importance of continuous improvement and innovation in AI sensor technology. Despite these challenges, the system respects the privacy of seniors, aligning perfectly with Aeyesafe's commitment to non-intrusive monitoring.\n\n Throughout my internship at Aeyesafe, I had the opportunity to learn and grow with the guidance and support of my mentors, colleagues, and the company. Their expertise and mentorship were invaluable in helping me navigate and overcome the practical challenges posed by modern sensor-based technology in healthcare. This experience emphasized the significance of continuous innovation in the field of eldercare and highlighted the immense potential of sensor technology in revolutionizing how we approach senior care."
        },
        {
            "time": "2:15 PM - 2:30 PM",
            "projectId": "csse-3-215",
            "title": "Hoop Hub: Innovating Social Networking for Basketball Enthusiasts",
            "studentName": "Yoon Lee",
            "studentMajor": "CSSE",
            "projectType": "Individual Project",
            "facultyAdvisor": "Dr. Jeff  Kim ",
            "posterLink": "./posters/csse/leeyoon_4198286_113461898_css497_poster.png",
            "abstract": "The “Hoop Hub” project is designed as a specialized platform for basketball enthusiasts, offering a space for them to connect, discuss, and organize local street basketball games. The motivation behind this project is to fill a gap in the market for sports-specific social networks, particularly for basketball fans. “Hoop Hub” aims to foster a sense of community and engagement around a shared passion by focusing on this group.\n\n The prototype of the platform’s primary features include user authentication, social networking, a forum for basketball discussions, and real-time chat capabilities. These features are carefully crafted to provide a fundamental social networking experience.\n\n Currently, it only offers these basic social networking functionalities, establishing a robust foundation for the platform. While it still needs to include advanced features, such as support for organizing street basketball games or displaying NBA games and schedules, its current capabilities are significant. This platform effectively facilitates social interactions and discussions among basketball players, distinguishing it from generic social networks.\n\n The project's significance lies in its focus on a targeted user group. With the potential to provide content that meets the needs of basketball enthusiasts that regular social network services cannot provide, “Hoop Hub” demonstrates the potential of niche social networks to foster more meaningful and engaged online communities. Looking forward, “Hoop Hub” has the potential to expand its functionalities, further enhancing its appeal to the basketball community and solidifying its position as a specialized social networking site. "
        },
        {
            "time": "2:30 PM - 2:45 PM",
            "projectId": "csse-3-230",
            "title": "BankApp: An online banking web application focused on security",
            "studentName": "Austin Schnarre",
            "studentMajor": "CSSE",
            "projectType": "Individual Project",
            "facultyAdvisor": "Dr. Erika Parsons",
            "posterLink": "./posters/csse/schnarreaustinedward_4200250_113475290_CapstonePoster-2.jpg",
            "abstract": "This capstone project comprised the development of a full-stack banking web application that aims to enhance financial management systems and user experience in the banking sector. With this, I aimed to create a secure and easy-to-use platform for both users and administrators that could interact with each other in a streamlined process.\n\n The reason I set out on this project was because I saw how the United States was so far behind in terms of cybersecurity and as recently as August 29th of 2023 M&T bank was hacked affecting millions of people showing that security in banks is still weak. Knowing this, I felt like it was important to get a better understanding of the process of building these websites with security in mind as well as how to hack them so that I can help prevent the problems we are having in terms of cyber defense. A lot of time was spent working on security aspects such as penetration testing the website myself for SQL injections, Cross-Site Scripting as well as others. \n\n In conclusion, the result of the project is a robust, secure baking application built from the ground up oriented around standard features within a banking application as well as security features. The development of this project not only contributes to the banking sector by providing the foundations for a real, secure proof of concept but also enhances my skills in knowledge as an aspiring full-stack web developer. "
        },
        {
            "time": "2:45 PM - 3:00 PM",
            "projectId": "csse-3-245",
            "title": "OL Reign Power Bi Dashboard Analysis",
            "studentName": "Fanuel Abraha",
            "studentMajor": "CSSE",
            "projectType": "Individual Project",
            "facultyAdvisor": "Ms. Nancy Kool",
            "posterLink": "./posters/csse/abrahafanuelfekadu_LATE_4146296_113519161_OL Reign Power BI Dashboard Analysis.pptx.png",
            "abstract": "This capstone project addresses the absence of user-friendly data visualization tools for women's sports enthusiasts in Seattle, with a focus on OL Reign, a prominent women's soccer team. Adopting industry-standard tools such as Visual Studio and SQL, the project followed a comprehensive methodology. The initiative commenced with meticulous data gathering, extraction, and organization, aiming to provide fans and analysts with an engaging and informative dashboard.\n\n The resulting Power BI dashboard offers a dynamic overview of OL Reign's performance, featuring real-time updates and a spectrum of customizable metrics. These metrics encompass match statistics including goals, assists, and possession percentages; player insights such as individual performance trends, and contribution to team goals; and team dynamics such as formations, tactical shifts, and overall strategies. In the face of technical challenges, including data integration complexities and software compatibility issues, I navigated through them with strategic problem-solving and a proactive approach to learning new concepts. The iterative nature of the project allowed for continuous refinement based on feedback and adaptability to evolving challenges. Throughout the development, initial tests involving a college soccer player revealed challenges related to metric relevance and effectiveness from a player's perspective. This feedback prompted adjustments to ensure that the metrics provided actionable insights for both analysts and players. Subsequent testing with a software engineering specialist brought to light interface complexities that were addressed to enhance overall user-friendliness and accessibility.\n\n In conclusion, this Power BI report for OL Reign represents a significant advancement in enhancing the fan experience through comprehensive, visually appealing, and user-friendly data visualization. It sets a precedent for similar initiatives in sports analytics, promoting informed decision-making in Seattle sports. Future enhancements envision the incorporation of advanced analytics, such as predictive modeling and trend analysis, player-specific metrics, and interactive features to elevate user experience richness. The project's ultimate vision includes transforming the tool into a website and app accessible nationwide, creating a unified platform for fans of various sports teams across the United States. This ambitious initiative aims to foster a community of informed and engaged sports enthusiasts. "
        },
        {
            "time": "3:00 PM - 3:15 PM",
            "projectId": "csse-3-300",
            "title": "",
            "studentName": "Brian Ying",
            "studentMajor": "CSSE",
            "projectType": "Individual Project",
            "facultyAdvisor": "Dr. Geetha Thamilarasu",
            "posterLink": "./posters/csse/yingbrianhaowei_LATE_3892228_113537145_Poster.jpg",
            "abstract": "This capstone was as a software development intern at Gekko Corporation. Gekko Corporation's mission is leveraging big data to solve business and consumer challenges, and has been focusing on making tools geared towards healthcare. I joined the Gekko Corporation team, which consisted of 3 other interns and the boss of the company at the time, and was largely delegated the tasks related to researching and integrating existing AI systems for our tools. \n\n Primarily, the issue we wanted to tackle was helping to make applications that could be used to make it easier for \"lower-level doctors\" (i.e., primary care provider) to diagnose patients. There are two problems related to healthcare that we wanted to address: first, healthcare is expensive for consumers—especially when it comes to using the Emergency Room; second, a lot of people go to the ER to get diagnosed, even for non-urgent illnesses, resulting in an inefficient use of healthcare resources in hospitals. If lower-level doctors are able to diagnose patients’ illnesses earlier, such as during or shortly after an annual check-up, it will benefit both the healthcare industry and the consumers. \n\n The primary objectives I was responsible for working on during my internship were:\n 1) Helping create and set up a Transcription & Summarization tool. This app would take an audio file, provide a transcript of it, and summarize/analyze the transcript (customizable depending on use case).\n 2) Setup a Pose Estimation script using the MediaPipe and OpenCV libraries in order to test its viability in helping with diagnoses or form analysis, such as for sports.\n \n\n We leveraged the work completed on our transcription and summarization tool a few weeks in and modified it for use in a UW Foster Professor’s class. This allowed us to test our tool and workflow in a real setting. \n\n The pose estimation worked, however its accuracy was questionable when there was a lot of dynamic movement in the video. As a result, the idea has largely been put on hold for now until further testing.\n\n In the end, the primary focus of the internship, the transcription and summarization tool, has proven to have a lot of flexibility and potential to be used for a variety of fields, and can further be expanded on for use in real healthcare settings."
        }
    ]
}


