{
    "csse": [
        {
            "time": "1:00 PM - 1:15 PM",
            "projectId": "csse-6-100",
            "title": "Migrating Machine Learning Pipelines to the Cloud with Mayo Clinic",
            "studentName": "Linnea Walsh",
            "studentMajor": "CSSE",
            "projectType": "Sponsored Internship or job opportunity ",
            "facultyAdvisor": "Dr. Mike Stiber ",
            "posterLink": "./posters/csse/walshlinnea_3958924_113480141_LinneaWalsh_PosterRevised.png",
            "abstract": "There’s been a lot of research done so far using machine learning to diagnose patients, determine treatment plans, and more. However, the difficulty comes in actually using these in real-world situations. These models aren’t shared with any hospitals or medical clinics, so doctors just don’t have a way to consult them when making decisions about a patient. Mayo Clinic, where I served as a software engineering intern, is in a unique position to change this. Mayo Clinic’s mission statement includes three prongs: clinical practice, research, and education. This makes them able to do both the research and the medical practice within the same organization.\n\n Despite having this advantage, many researchers at the Mayo Clinic still struggle to make their machine learning models available to healthcare workers. The ideal way to carry this out would be to host the models in the cloud, carrying all the benefits that the cloud provides. However, these people have degrees in data science, statistics, health science, or similar. They just aren’t cloud computing experts. So, they needed a guide to walk them through how to take the model they had made and move it to the cloud.\n\n That’s exactly what I did during my internship; I developed and documented the process of migrating a machine learning model to the cloud. While there were already workflows in place for some of these steps, none of them were customized for the unique situations that Mayo Clinic analysts would be in. I researched the tools and frameworks that were standardized within Mayo Clinic and what processes would be needed to use these specifically. Once I had a routine that worked, I compiled all steps and documented what would be necessary for one to complete this procedure from start to end.\n\n This process was not an easy one. I had to take a major step into real-world production environments where I encountered a significant number of unseen hurdles, many of which took days for me to resolve even with the help of more experienced colleagues. This would have stumped or crippled someone who has less opportunity for education about cloud computing or doesn’t have access to the same resources. Additionally, it makes more sense for one person to resolve these problems and document the solutions, rather than each user having to figure them out for themselves. This is why my contributions were important to help Mayo Clinic make their research more accessible to other employees within the system, improving health outcomes and overall making patients healthier. "
        },
        {
            "time": "1:15 PM - 1:30 PM",
            "projectId": "csse-6-115",
            "title": "GraphML Visualizer Enhancements for the Graphitti Project",
            "studentName": "Jacob White",
            "studentMajor": "CSSE",
            "projectType": "Individual Project",
            "facultyAdvisor": "Dr. Mike Stiber",
            "posterLink": "./posters/csse/whitejacobm_3824986_113476014_jacob24Poster497.jpg",
            "abstract": "Over the course of my capstone project, I worked to enhance the GraphML visualizer used for the Graphitti project. This entailed a dialog box prior to visualizing the graph, a tabular view of the selected GraphML file, and a property editor. Additionally, synthetic graph generation is currently being implemented.\n\n Graphitti is a simulator of graph-based systems developed by the Intelligent Networks Laboratory. The project is being applied to emergency service communication systems, creating the Next Generation 911 project, or NG911. NG911 utilizes GraphML, a file format based on XML which consists of a language core to define a graph’s structural properties. GraphML files are then processed by the visualizer to create and display graphs. I enhanced the GraphML visualizer's user experience by introducing key features. Firstly, a user-friendly dialog box was implemented to eliminate the need for altering hardcoded values in the code, simplifying program interaction. Additionally, a tabular view was incorporated, allowing users to comprehend graph data effortlessly without needing to understand the GraphML file format. Furthermore, a property editor was introduced, streamlining the process of node editing without direct GraphML file involvement. Users can easily select and modify nodes, making changes efficiently.\n\n The ongoing implementation of synthetic graph generation involves creating root nodes, forming a Voronoi diagram using these roots, generating leaf nodes within designated regions, and connecting roots with edges based on neighboring regions.\n\n In summary, my capstone project significantly improved the overall user experience of the GraphML visualizer. These enhancements will notably facilitate testing and experimentation for the Next Generation 911 project. "
        },
        {
            "time": "1:30 PM - 1:45 PM",
            "projectId": "csse-6-130",
            "title": "UWTechPrep: Facilitating Mentor Network",
            "studentName": "Mehar Kambo",
            "studentMajor": "CSSE",
            "projectType": "",
            "facultyAdvisor": "Dr. David Socha",
            "posterLink": "./posters/csse/kambomehak_4021988_113465913_Mehak_Poster.jpg",
            "abstract": "The aim of this capstone project was to modernize UWTechPrep, a mentoring platform for software engineering students, by migrating it to a full-stack architecture. The architecture underwent a significant shift, with the front-end being completely redesigned using React.js. The back-end was restructured as a REST API built upon the Python Flask framework. Both aspects were then integrated with a MySQL database.\n\n The new architecture enabled the introduction of several new features, including streamlined user profile management, enhanced meeting scheduling for students, direct session reservation with mentors and availability management for the mentors. These features significantly simplified user interactions and improved overall usability of the platform.\n\n UWTechPrep expanded its offerings beyond mock interviews, giving students a comprehensive learning experience. The platform equips students for the fast-paced tech world by offering them a diverse range of resources and challenges, including mentorship for various programs. Our goal is not only to prepare students for immediate employment but also to foster a love for continuous learning. We believe that UWTechPrep can bridge the gap between academia and industry, empowering students to become successful software engineers.\n\n In conclusion, this capstone project successfully transformed UWTechPrep into a valuable resource for software engineering students. The platform is well-positioned to facilitate job placement and career advancement, ultimately shaping the future of the software engineering industry. "
        },
        {
            "time": "1:45 PM - 2:00 PM",
            "projectId": "csse-6-145",
            "title": "Software Development Internship @ Amazon Web Services",
            "studentName": "Sushruth Mullur",
            "studentMajor": "CSSE",
            "projectType": "Sponsored Internship or job opportunity ",
            "facultyAdvisor": "Dr. David Socha",
            "posterLink": "./posters/csse/mullursush_4020539_113429476_Graphical Draft (3).png",
            "abstract": "Cloud computing and machine learning play pivotal roles in the software industry, supporting various enterprise and consumer solutions. AWS Wisdom, a cloud-based AI product, enhances customer service by providing real-time recommendations to agents based on ongoing conversations. To optimize the accuracy and relevance of these recommendations, Wisdom's applied scientists require continuous feedback on user interactions. To address this, the Wisdom engineering team implemented a system for collecting metrics. My internship project over the summer of 2023 required me to take the metrics, aggregate them, and build out a system to visualize or search through these metrics. I focused on designing and implementing a comprehensive cloud architecture using AWS services, including AWS Glue for data aggregation, AWS OpenSearch for storage and search functionality, and AWS Lambda for backend logic./n/n The project timeline comprised 2 weeks of onboarding, 2 weeks for design and feedback, and 8 weeks for implementation and demo. During onboarding, I immersed myself in Amazon's culture and Leadership Principles, emphasizing ideals such as Thinking Big, Disagreeing and Committing, and recognizing that Leaders Are Right, A Lot. This approach fostered a sense of ownership and encouraged me to consider the underlying rationale behind decisions. The design phase involved crafting an architecture through interviews and design reviews with data scientists and engineers, incorporating feedback and adhering to principles like frugality and scalability. The subsequent implementation and testing phase spanned 7-8 weeks, during which I utilized tools such as CloudWatch logs, Postman, Flask, and Kotlin.\n\n The project culminated in a successful demo for the Wisdom organization, receiving positive feedback. Collaborating closely with my team, I gained insights into thorough testing, scalable development, and cloud computing. Additionally, I acquired non-technical skills such as following the Scrum process over 5 2-week sprints, documentation practices for project code and transition, and conducting over a dozen interviews with Amazonians to get project feedback. The internship at Amazon significantly contributed to my continuous learning in software development practices, providing a strong foundational experience for the start of my career."
        },
        {
            "time": "2:00 PM - 2:15 PM",
            "projectId": "csse-6-200",
            "title": "Enhancing Social Understanding and Collaboration in Autistic Individuals Through Digital Social Stories",
            "studentName": "Elizabeth Castillo",
            "studentMajor": "CSSE",
            "projectType": "Faculty Research",
            "facultyAdvisor": "Dr. Annuska Zoloymi",
            "posterLink": "./posters/csse/castilloelizabeth_LATE_4106478_113484026_PosterCSSE-Capstone-Autumn2023-Elizabeth_Castillo-1.png",
            "abstract": "This study explores the effectiveness of digital social stories in aiding autistic individuals' understanding of social interactions, emotions, and activities. Social stories, primarily designed for neurodivergent individuals, are a pivotal tool in preparing them for various events and transitions in their daily routines. Delving deeper, the research specifically targets Panama, aiming to understand how the unique cultural nuances and societal attitudes in this region influence the use and reception of digital social stories. This focus offers valuable insights into the interplay between local cultural contexts and the implementation of educational tools for neurodiversity, potentially guiding future adaptations to enhance their effectiveness within diverse communities./n/n A significant consideration is technological accessibility. The platform, designed for inclusivity, caters to users with limited WiFi access but with smartphones capable of displaying images. Notably, it is compatible with Android smartphones (used by 70% of the intended user base), iPads, and iPhones, ensuring wide-reaching accessibility in Panama./n/n Central to these stories is their design to enhance the communicative abilities of autistic individuals, grounded in the concept of nurturing connections and understanding. The research methodology included hands-on interviews with Panamanian mothersof autistic individuals conducted in Spanish. The insights gained were translated and analyzed, informing the development of a Figma prototype for an application tailored to this demographic./n/n Overall, this study aims to enrich our understanding of how technology can support and enhance the collaboration and communication strategies of autistic individuals, with the ultimate goal of creating a digital platform that educates and fosters deeper connections between autistic individuals and their support networks. "
        },
        {
            "time": "2:15 PM - 2:30 PM",
            "projectId": "csse-6-215",
            "title": "Team Up: A Website Automating Student Team Formation",
            "studentName": "Daniela Cuevas",
            "studentMajor": "CSSE",
            "projectType": "Faculty Research",
            "facultyAdvisor": "Dr. Annuska Zoloymi",
            "posterLink": "./posters/csse/cuevasdaniela_LATE_4201406_113490409_capstone poster-2-Daniela Cuevas (12).png",
            "abstract": "Team Up is a website that aims to automate the creation of teams within classes based on students’ personal working styles and needs started by Professor Zolyomi's research team, the IDEA LAB. My responsibility was to conduct research regarding the successful structures of teams and stylize the front end of the website that had been created by previous students in 2022-23 based on their wireframes./n/n A challenge that many students and instructors face is deciding what team to work with for group assignments/projects. Many teams are randomly assigned, or students decide which team they want to work with. Neurodivergent students can also struggle with student teams with either not feeling comfortable disclosing their disabilities or feeling like their needs are not addressed. Team Up aims to group students through a Machine Learning (ML) Model based on their skills, personality, goals, and previous experience with teams. This will help improve team collaboration to meet students’ needs and lead to team success because the ML Model in the future will group students based on previous successful team distribution./n/n During the quarter I conducted a survey for university students about their general team styles including conflict styles, schedules, and other preferences to help begin setting up an ML Model to cluster students into teams based on matching preferences. The main home page, log-in, and sign-in page were also successfully stylized to allow for future usability testing next quarter. The home page now includes information about Team Up and our team, as well as a stylized vertical navigation when signed in and a horizontal navigation bar when logged out. Future students will expand on this project, so we created clear documentation for each section of the front end and ML model so that the transition between students can be easier to continue Team Up’s growth. "
        },
        {
            "time": "2:30 PM - 2:45 PM",
            "projectId": "csse-6-230",
            "title": "Enhancing Team Formation in University Settings: A Machine Learning Approach",
            "studentName": "Trinh To",
            "studentMajor": "CSSE",
            "projectType": "",
            "facultyAdvisor": "Dr. Annuska Zoloymi",
            "posterLink": "./posters/csse/totrinh_4145185_113472336_TrinhTo_Poster.png",
            "abstract": "In the realm of university education, effective team formation is crucial for fostering collaboration and maximizing the learning experience. The traditional manual approach to team assignments often lacks the depth of insights that data-driven methods can provide. Our project, Team Up, a web-based tool developed by Professor Zolyomi's IDEA LAB, seeks to improve this process by allowing instructors and students to build teams informed by machine learning models.\n\n Team Up addresses the challenges of manual team formation by introducing a machine-learning model, the \"team recommender.\" This model automates the team formation process based on compatibility factors such as schedules, personalities, values, and preferences. The significance of this project lies in its potential to provide a structured and efficient approach to team building, contributing to a more inclusive and collaborative learning environment.\n\n To create the team recommender, a comprehensive survey was conducted to understand students' teamwork preferences and to gather a dataset for training and testing. The next step was to preprocess the data, apply two types of clustering algorithms (K-Means and Hierarchical), evaluate cluster quality, regroup clusters to meet target sizes, and propose future steps. Key variables considered included communication, punctuality, flexibility, and other factors related to successful collaboration. Cluster quality was evaluated using metrics like Silhouette Score (0.4705 for K-Means, 0.1170 for Hierarchical), Davies-Bouldin Index (0.7044 for K-Means, 1.1923 for Hierarchical), and Calinski-Harabasz Index (176.51 for K-Means, 4.3533 for Hierarchical). K-Means outperformed Hierarchical clustering across the evaluation metrics in creating well-formed clusters. The result demonstrates an initial data-driven system for grouping students based on preferences and tendencies, rather than relying solely on manual assignments.\n\n Looking ahead, our roadmap involves fine-tuning algorithms, crafting a supervised learning model, and testing our system in real-world classroom settings. It's a journey towards seamlessly integrating machine learning into Team Up, with the goal of maximizing collaborative potential in university classrooms. "
        },
        {
            "time": "2:45 PM - 3:00 PM",
            "projectId": "csse-6-245",
            "title": "The AAC Conversation App",
            "studentName": "Reyhan Koyun",
            "studentMajor": "CSSE",
            "projectType": "",
            "facultyAdvisor": "Dr. Annuska Zoloymi",
            "posterLink": "./posters/csse/koyunreyhan_4173688_113478176_ReyhanKoyunPoster.png",
            "abstract": "Augmentative and Alternative Communication (AAC) systems serve as a lifeline for non-verbal autistic individuals, facilitating expression and participation in a world where verbal communication is predominant. The AAC Conversation App represents a pivotal step in this domain, transitioning from static symbol selection to a dynamic, context-aware system that adapts to the user's immediate environment. This project encapsulates the development of an innovative iOS application designed to enhance text-to-speech communication for autistic individuals by introducing adaptive vocabulary tailored to the user's location, time of day, and designated activities.\n\n The essence of the project lies in its user-centric design. The Home-View serves as the core interface, featuring a comprehensive array of default words, pertinent folders, and contextual terms relevant to the home setting. Diving deeper, the Folder-View presents words and symbols specific to selected categories, enriching the communicative experience. The Room-View allows users to identify their current settings within the home, such as the kitchen, where the Kitchen-View then offers tailored vocabulary for that environment. A key innovation is the Time-Picker function, which refines the symbol set to align with the time-specific activities, like meals and daily routines.\n\n The application's development, guided by prior research and user needs surveys, is driven to foster autonomy and inclusivity. By enabling users to navigate through intuitively designed rooms and times of day, the app aims to reduce communicative barriers and enhance the user experience. The significance of this capstone work transcends its immediate functionality—it lays the groundwork for future exploration into context-aware assistive technologies. It reaffirms the potential of AAC systems to evolve and adapt to the complex tapestry of human interaction.\n\n This capstone project contributes to the academic and research landscape through meticulous programming, UI/UX design, and context-aware algorithms. It serves as a testament to the transformative power of technology in accessibility and communication. "
        },
        {
            "time": "3:00 PM - 3:15 PM",
            "projectId": "csse-6-300",
            "title": "Wheelwild",
            "studentName": "Aaron Nguyen",
            "studentMajor": "CSSE",
            "projectType": "Faculty Research",
            "facultyAdvisor": "Dr. Annuska Zoloymi",
            "posterLink": "./posters/csse/nguyenaaron_4146246_113475321_Poster.jpg",
            "abstract": "This capstone project, titled Wheelwild, focuses on the development of a mobile application aimed at empowering individuals with reduced mobility to explore nature with greater ease and safety. The motivation behind this endeavor is to bridge the gap in outdoor exploration for people with varying mobility levels, facilitating access to nature’s beauty in a manner respectful of their limitations. The Wheelwild app, designed using Figma, serves as a comprehensive platform for locating, reviewing, and sharing information about accessible outdoor trails and parks.\n\n Key features of the Wheelwild app include a user-friendly trail and park search function, user reviews and ratings for real feedback, a photo upload option to validate accessibility claims, community stories for shared experiences, and an emergency locator for increased safety. The design considerations in Figma encompass clear, high-contrast color schemes, readable fonts, recognizable icons, an interactive map, simple navigation, and accessible safety alerts. These features are meticulously tailored to meet user requirements such as finding suitable trails, reading and sharing personal stories, and ensuring safety through location-sharing capabilities. In parallel, this project extends to a collaboration with Professor Zolyomi on WhimsyWalks, a website dedicated to supporting wheelchair users in navigating Seattle’s art walks. My role involved developing a curated map page, utilizing Google My Maps and data from Project Sidewalk, to enhance pre-visit planning for users. This synergy not only reinforced the practical application of my skills but also aligned closely with Wheelwild’s objectives. A pivotal aspect of this integration is the unified mapping system. By leveraging Project Sidewalk's data, the map offers invaluable insights into the accessibility of sidewalks and paths, encompassing factors like curb cuts, surface quality, and inclines. This feature is central to the Wheelwild app, where users can find and navigate accessible trails and parks, and enhances the WhimsyWalks project by providing detailed information on the accessibility of routes for art walks in Seattle.\n\n The significance of this project lies in its dual impact: firstly, it addresses a crucial need for inclusivity in outdoor recreation for those with limited mobility, and secondly, it integrates mobile and web technologies to create a seamless user experience. The results of this project demonstrate the potential of technology to create more inclusive and accessible environments, encouraging equal participation in outdoor activities and fostering a more inclusive community."
        },
        {
            "time": "3:15 PM - 3:30 PM",
            "projectId": "csse-6-315",
            "title": "Internship at Perfect Corp",
            "studentName": "Rosie Shen",
            "studentMajor": "CSSE",
            "projectType": "Faculty Research",
            "facultyAdvisor": "Dr. Annuska Zoloymi",
            "posterLink": "./posters/csse/shenrosietian_LATE_4114777_113517830_1702347390730-3fd5cb90-24c7-4a34-a76f-5f2b929a6971_1.jpg",
            "abstract": "This capstone project, conducted during an internship at Perfect Corp., an AR/VR software company specializing in beauty tech, explores the enhancement of facial segmentation tools. The primary objective was to investigate and improve the performance of facial detection and segmentation algorithms using machine learning techniques.\n\n The approach involved fine-tuning a pre-trained BEiT (BERT Pre-Training of Image Transformers) neural network model. This approach aimed to assess the effectiveness of transformer-based architectures in image-related tasks, particularly in facial detection and segmentation. This model was chosen for its potential to handle image-based tasks, specifically facial detection, efficiently. The project leveraged MMSegmentation, an open-source Python segmentation toolbox in PyTorch, to facilitate this process.\n\n To support this, a comprehensive pipeline was developed to streamline the facial detection and segmentation process, which involved evaluating various facial detection tools. The evaluation included tools from OpenCV, Mediapipe, and Facer for aligning datasets in the pipeline. The results of this project included a detailed evaluation of several facial detection tools and the effectiveness of the BEiT neural network model in binary segmentation tasks. The results summarize the effectiveness of transformer architectures in enhancing the accuracy and efficiency of facial segmentation applications.\n\n This capstone project demonstrates the applicability of deep learning transformer architectures in practical, real-world scenarios. The findings and methodologies offered insights in pursuing advanced facial segmentation solutions to enhance the user experience with more precise and realistic AR/VR experiences."
        }
    ]
}

