{
    "csse": [
        {
            "time": "1:00 PM - 1:15 PM",
            "projectId": "csse-5-100",
            "title": "Smart Lexicon: Reducing False Positive Compliance Alerts",
            "studentName": "Cordelia Notbohm",
            "studentMajor": "CSSE",
            "projectType": "Sponsored Internship or job opportunity",
            "facultyAdvisor": "Dr. Laurie Anderson",
            "posterLink": "./posters/csse/notbohmcordeliaevelyn_4126765_113022287_CSS497_Notbohm_Poster_Final.jpg",
            "abstract": "During my internship at Hearsay Systems, a company that makes communication tools for financial companies, two other interns and I worked on a feature called “Smart Lexicon.”\n\n Hearsay’s product allows customers to define a lexicon, used to flag posts and messages that contain specific words or phrases. Many customers define a wide lexicon net, to ensure all problematic posts get flagged and to avoid financial fines. These wide lexicon nets can create lots of false positive alerts. In some cases, the number of alerts becomes too large for compliance admins to manage. This can lead customers to bulk dismiss the alerts, without acting on them, leaving problematic posts unseen and leaving the customer more susceptible to fines.\n\n To solve this problem, we used an event-based architecture. When a compliance admin acts on an alert, an event is published on EventBridge. Our feature listens to that event with Lambda Functions and uses the event details to deduce whether a lexicon violation was problematic. It stores that analysis in a DynamoDB table, and other Lambda Functions use that analysis to generate suggestions for improving a customer’s lexicon. Using events allowed us to easily modularize and encapsulate our feature. Additionally, using AWS’s existing infrastructure/services made the feature easy to deploy and scale up, allowing “Smart Lexicon” to grow in the future.\n\n By the end of the internship, we were able to complete and demo an initial version of “Smart Lexicon” to the engineering team. We fully documented the project including steps taken to design the feature, steps required to run the feature, and steps that could be taken to improve the feature. \n\n “Smart Lexicon” ended as a successful proof of concept. We demonstrated how the feature provides value to customers, we investigated how best to design the feature, and we discovered solutions for implementation roadblocks. Additionally, we left behind the knowledge required to continue working on the feature, allowing Hearsay to eventually deploy it to production in the future. Once deployed, it is expected the feature will decrease the time required for compliance admins to manage financial advisors’ posts and reduce the rate of bulk dismissals, improving our customer’s relationship with their clients "
        },
        {
            "time": "1:15 PM - 1:30 PM",
            "projectId": "csse-5-115",
            "title": "Software Engineering Internship @ Amazon",
            "studentName": "Milton Melson",
            "studentMajor": "CSSE",
            "projectType": "Sponsored Internship or job opportunity",
            "facultyAdvisor": "Dr. Yang Peng",
            "posterLink": "./posters/csse/melsonmilton_4170755_113416806_Poster.png",
            "abstract": "During my internship at Amazon, I contributed to the Classification and Policy Platform (CPP) organization. I focused on enhancing the CPP website by introducing a feature that enables rule writers to test various rules within different keyword classes. These classes play a crucial role in accurately identifying and classifying Amazon products, ensuring proper placement within the marketplace.\n\n This project addressed a persistent need within the CPP organization spanning seven years. The existing rule-writing process, while functional, relied on multiple external tools, prolonging the time needed for rule creation and refinement. The transfer of work between tools, such as notepad, introduced human errors into the process. Upon project completion, the rule-writing team could abandon external tools and streamline rule refinement directly within the CPP website. They gained the ability to experiment with different ideas, refine rules without modifying the existing ones, and assess results. The feature empowered them to make informed decisions, optimizing the accuracy of rules.\n\n Modifying existing keyword rules presented inherent complexity and risk. The new feature, although requiring an initial investment of time for testing, is anticipated to significantly reduce the volume of rule refinement tickets and time spent on the process. Additionally, by eliminating the need to transfer data between external tools, the feature is expected to minimize human errors, enhancing overall efficiency. "
        },
        {
            "time": "1:30 PM - 1:45 PM",
            "projectId": "csse-5-130",
            "title": "DiaboPredict",
            "studentName": "Tejasvi Narayanan",
            "studentMajor": "CSSE",
            "projectType": "Individual Project",
            "facultyAdvisor": "Dr. Wooyoung Kim ",
            "posterLink": "./posters/csse/narayanantejasvi_4132502_113449120_Poster_Teja Narayanan.png",
            "abstract": "The advent of machine learning (ML) in bioinformatics has opened up a new era of data-driven insights. “DiaboPredict,” a state-of-the-art web application, demonstrates the potential of ML in analyzing, transforming, and interpreting the data for diabetes risk assessment. While ML holds immense promise, challenges in model interpretability have impeded widespread adoption among domain stakeholders, including medical practitioners, patients, and researchers. The need for a transparent and straightforward technology is vital to ensure broad accessibility and usability. Addressing these challenges is the primary goal of DiaboPredict and it empowers individuals to assess their risk of diabetes.\n\n DiaboPredict harnesses a cutting-edge ML approach that combines data preprocessing, feature engineering, and multiple robust algorithms to analyze user-provided data. The model considers numerous factors, including age, lifestyle, family history, and health metrics, to generate a personalized diabetes risk score.\n\n Following the prediction, DiaboPredict goes a step ahead by generating a user report to highlight the risk score and deliver valuable insights into the factors contributing to the risk too. This unique feature provides users with actionable information, guiding them toward informed lifestyle choices for proactive diabetes management.\n\n Additionally, DiaboPredict delves deep into the training data, exploring correlations and patterns to uncover insights. This exploration enhances the accuracy of risk assessment by identifying relationships in the data. These insights are available to the user for a better understanding of diabetes risk. What sets DiaboPredict apart is not only its accuracy in predicting diabetes risk but also its commitment to user empowerment. Unlike other prediction apps, DiaboPredict goes beyond by delivering a risk score by providing personalized insights and actionable information. Its emphasis on transparent and user-friendly reporting, coupled with the in-depth exploration of training data, ensures a comprehensive understanding of individual risk factors. My learning experience throughout this project has been challenging and rewarding in the following process areas: Requirements analyses, collaboration, and user-centered design, alongside gaining technical proficiency in Python, Machine Learning, Data Science, and Web Development. This on-the-job exposure has significantly contributed to my professional growth.\n\n In conclusion, DiaboPredict signifies a substantial leap in leveraging machine learning for a comprehensive diabetes risk assessment. "
        },
        {
            "time": "1:45 PM - 2:00 PM",
            "projectId": "csse-5-145",
            "title": "CART Insight Engine: An ML-based Prediction Tool",
            "studentName": "Vivek  Hegde ",
            "studentMajor": "CSSE",
            "projectType": "Individual Project",
            "facultyAdvisor": "Dr. Wooyoung Kim ",
            "posterLink": "./posters/csse/hegdevivekprashant_4012360_113447990_Colloquium Poster.png",
            "abstract": "CART cell therapy is a groundbreaking form of immunotherapy used in the treatment of cancer. It works by infusing the “T-cells”, which is a type of white blood cells, with the Chimeric Antigen Receptors to artificially prepare a CART cell receptor molecule. This Chimeric Antigen Receptor has two surfaces – inner and outer. The inner surface of the CAR binds with the T cell to activate the CART molecule. The outer surface of the CAR binds with the cancer cell and destroys it.\n\n The problem here is that the patients body will respond differently depending on how the inner surface of the CAR binds with the T cell of the patient. Based on clinical trials, it will most likely result in one of four different outcomes – Optimal response, Cytokine Release Syndrome response, Neurotoxic response, and Poor response. Some of these outcomes are life threatening and we need to mitigate that risk.\n\n This is the significance of my capstone work. To solve this problem, I have successfully developed a web application that harnesses the power of machine learning to help doctors predict this outcome before injecting anything into the patient. This solution was chosen because through machine learning and data science, we can detect patterns and themes more easily. Ultimately, this will result in better medical care for the patients undergoing this type of treatment. "
        },
        {
            "time": "2:00 PM - 2:15 PM",
            "projectId": "csse-5-200",
            "title": "Machine Learning Studio",
            "studentName": "Adilet Kuroda",
            "studentMajor": "CSSE",
            "projectType": "Individual Project",
            "facultyAdvisor": "Dr. Wooyoung Kim",
            "posterLink": "./posters/csse/kurodaadilet_LATE_4261030_113482287_Poster Adilet Kuroda.png",
            "abstract": "Field of machine learning (ML) is rapidly evolving with application across diverse domains. Hands-on experience with ML algorithms is limited for the students without coding skills. As part of my capstone project, I created an interactive no code web platform to provide opportunity to the learners practice and understand the concepts in machine learning algorithms without any prior experience in coding. In addition, I also worked on exploring application of Convolutional Neural Networks for tabular data.\n\n This platform consists of both supervised and unsupervised machine learning algorithms. The supervised algorithms available include linear regression, decision trees, ensemble methods, and neural networks. Additionally, this platform offers unsupervised algorithms include clustering and dimension reduction techniques.\n\n One of the main aspects of this platform allowing student to engage in hyperparameter tuning. This enable and allows learners to experiment with different parameters and observe model performance based on change in the hyperparameters. This gives opportunity to the understand the relevance of the hyperparameters in evaluating the model performance in various classification scenarios.\n\n In addition, this platform allows learners to set up data processing pipeline. Learner can upload their dataset or use provided dataset to to apply data normalization and cleaning and feature selection techniques that essential in machine learning. This will enable learner to understand the relevance of data processing in machine learning workflow and how preprocessing the data can impact the overall effectiveness of the model.\n\n As part of my capstone, I also explored potential use of Convolutional Neural Networks (CNN) for tabular data. Even though CNNs are used for image recognition and analysis tasks, it can also be used for tabular data. This research involved exploring existing approaches in the field and what could be done to improve these processes. This allowed to gain deeper understanding of feasibility and possible improvement CNNs for tabular data.\n\n Outcome of this projects is a user-friendly no-code web platform that enable students to explore and machine learning algorithms through hands on experience. This platform allows users set up data processing pipeline and explore various supervised and unsupervised machine learning algorithms. In terms of research in application of CNNs for tabular data, I gained deeper understanding for the subject and plan on further exploring the potential use cases. "
        },
        {
            "time": "2:15 PM - 2:30 PM",
            "projectId": "csse-5-215",
            "title": "ML Collaboration platform's User manage",
            "studentName": "David Woo",
            "studentMajor": "CSSE",
            "projectType": "Individual Project",
            "facultyAdvisor": "Dr. Wooyoung Kim ",
            "posterLink": "./posters/csse/woodavid_4075090_113475548_Poster (3).png",
            "abstract": "In the rapidly evolving field of bioinformatics, the need for effective collaboration between domain experts and machine learning practitioners is paramount. My capstone project, titled \"IBioML: A Collaborative Platform for Domain Experts and ML Developers,\" directly addresses this need. This project aims to develop an interpretable machine-learning platform tailored to pattern recognition in biological data, thereby facilitating a vital link between medical professionals and machine-learning developers. The core of this project involved transitioning from a general signup and login model to a more secure and efficient Single Sign-On (SSO) mechanism complemented by Two-Factor Authentication (2FA) for enhanced security. This significant shift was driven by the need for a more user-friendly yet secure access method to sensitive and critical medical data. The platform’s development unfolded in a Linux server environment, requiring careful handling of permissions and server configurations, particularly with Nginx and Gunicorn.\n\n The effectiveness of the new user authentication model was rigorously tested through A/B testing methodologies. This involved comparing the traditional general signup/login approach (Group A) against the new SSO method (Group B), focusing on metrics such as user feedback scores, login/signup time, and overall user satisfaction. The results were revealing; the SSO method demonstrated a 22.59% increase in user satisfaction compared to the traditional method.\n\n The project's significance lies not just in its technical achievements but also in the broader impact it has on the collaboration between two distinct yet interconnected fields. By providing a more streamlined and secure way to access and interpret complex biological data, \"IBioML\" enhances the collaborative potential, leading to faster and more effective solutions in bioinformatics research.\n\n Courses like CSS 301 (Technical Writing), CSS 480 (Human-Computer Interaction), and CSS 310 (Introduction to Information Assurance & Cybersecurity) proved invaluable in this journey, providing both the theoretical foundation and practical skills needed to tackle the challenges encountered.\n\n In conclusion, the \"IbioML\" project successfully demonstrates the power of interdisciplinary collaboration, facilitated by thoughtful application of technology, in driving forward the frontiers of research and innovation in bioinformatics. "
        },
        {
            "time": "2:30 PM - 2:45 PM",
            "projectId": "csse-5-230",
            "title": "iBioML: COmparative Analysis: Enhancing Accuracy in Dat Modeling through Tabular-to-Image Conversion and CNN Implementation",
            "studentName": "Gina Yeom",
            "studentMajor": "CSSE",
            "projectType": "Faculty Research",
            "facultyAdvisor": "Dr. Wooyoung Kim ",
            "posterLink": "./posters/csse/yeomgina_LATE_4178745_113590760_ResearchPoster-Horizontal.png",
            "abstract": "In my Spring 2023 Capstone research, my focus was on developing a machine learning (ML) model with high interpretability and accuracy for biological datasets. Much of the effort was devoted to feature engineering, experimenting with various techniques. However, despite my best efforts, the maximum achievable accuracy stalled at around 80%. In seeking ways to enhance accuracy, I contemplated whether transitioning from traditional ML to a deep learning approach, specifically using a Convolutional Neural Network (CNN), might yield improved results.\n\n To explore this, I decided to test the data with CNN model and see if switching the model to CNN will increase the possibility of achieving higher accuracy. Since CNNs are designed for image data, finding a way to transform tabular data into images was the first step. I chose to use IGTD, an open-source tabular-image conversion method, and conducted experiments on two datasets: depression data and cardiovascular disease (CVD) data.\n\n The methodology involved constructing and comparing ML models with various algorithms against a simple 3-layer CNN model. I evaluated the accuracy of the traditional ML models using original tabular data and compared the highest accuracy achieved with the accuracy achieved by the CNN model using converted images.\n\n The outcome revealed a substantial increase in accuracy across both datasets when using the CNN model with converted images. While the ML models exhibited accuracy in the range of 70-80%, the CNN model achieved exceptional accuracy levels, reaching 98.5% for CVD data and 99% for depression data. "
        },
        {
            "time": "2:45 PM - 3:00 PM",
            "projectId": "csse-5-245",
            "title": "UW School of Medicine: Volunteer Management System",
            "studentName": "Bruno Futino",
            "studentMajor": "CSSE",
            "projectType": "Faculty Research",
            "facultyAdvisor": "Dr.Wooyoung Kim ",
            "posterLink": "./posters/csse/futinobruno_4170493_113478643_Poster-1.png",
            "abstract": "Service Learning is a program from the University of Washington School of Medicine that offers opportunities for students to volunteer and hone their skills while addressing the health needs of underserved communities. The program currently supports over 70 projects in six locations, including Alaska, Idaho, Montana, Seattle, Spokane, and Wyoming.\n\n The Service Learning website worked as a listing for students to find opportunities to volunteer. Although the website worked great as a tool for students to find opportunities to volunteer for, it did not offer the ability for students to sign up for those opportunities, requiring project leads to use third-party websites for tracking the students that volunteered. While there are websites for managing volunteers and sign-up sheets, most of those websites lacked important features and customization options needed by our project leads. The websites that did offer those features usually charged a subscription fee per organization or per volunteer count, which was not viable considering that Service Learning currently supports seventy-three projects with hundreds of volunteers and has a limited amount of funding.\n\n This project aims to address the needs of volunteers and project leads while offering a cost-effective solution embedded within the Service Learning website. The new sign-up system seamlessly integrates with the existing website, ensuring a smoother experience for volunteers and leaders. It was integrated into the current website using the same technologies and platforms such as Typescript, React, Vercel, and Firebase.\n\n The newly developed sign-up system is currently being tested with the largest program featured on the Service Learning website, with plans for a gradual rollout to other programs. We are currently monitoring to identify and address any user-reported issues. Feedback from users is also being recorded, and potential improvements are being explored. This initial rollout includes around 30 volunteers, and we expect to get in the hundreds soon as we add more projects to the testing pool. "
        },
        {
            "time": "3:00 PM - 3:15 PM",
            "projectId": "csse-5-300",
            "title": "UW School of Medicine: Volunteer Management System",
            "studentName": "Kush Chopra",
            "studentMajor": "CSSE",
            "projectType": "Individual Project",
            "facultyAdvisor": "Dr.Wooyoung Kim ",
            "posterLink": "./posters/csse/choprakush_LATE_4045820_113699145_Poster3-1.png",
            "abstract": "The iBioML website, developed for the University of Washington Bothell, represents a significant stride in bridging the gap between domain experts in biotechnology and machine learning developers. This dynamic website features a home page, projects page, a unique 'Gene Chat' forum, and various static pages such as information, address, mission statements, and more. Central to iBioML's innovation is the 'Gene Chat' hub, a collaborative environment where professors and faculty can post biotechnology questions alongside relevant datasets, which students in Machine Learning then address through code and reports. This interaction fosters a hands-on learning experience, enhancing the practical skills of students while offering faculty insights into current methodologies in machine learning.\n\n My contribution to this project involved coding the entire website, ensuring seamless integration of various components and a user-friendly experience. While team members assisted in rectifying minor bugs, a notable addition was the integration of a communication hub, conceptualized as a capstone project by one of the team members and integration of OAuth for users in sign up journey. This feature introduced an API creating dedicated communication channels - akin to platforms like Slack, Discord, Zoom, or Teams - for each posted question, thereby enhancing interaction and collaboration.\n\n iBioML is more than just a repository for datasets; it is a dedicated platform for continuous learning and skill enhancement, serving as a bridge between theoretical knowledge and practical application. It addresses significant challenges in the collaboration between domain experts and machine learning engineers, such as language barriers and coordination complexities. These challenges often stem from diverse educational backgrounds leading to miscommunication, and the complexity involved in coordinating tasks, updates, and meetings. By providing a structured yet flexible environment for interaction and problem-solving, iBioML stands as a testament to innovative educational tools in the realm of bioinformatics, fostering a symbiotic relationship between data providers and machine learning engineers. "
        }
    ]
}

